package com.soroko.project.textQuest;

public class Constants {

    public static final String START_GAME = "Начать игру";
    public static final String RETURN_GAME = "Вернуться к игре";
    public static final String EXIT_GAME = "Выйти из игры";
    public static final String SAVE_GAME = "Сохранить игру";
    public static final String LOAD_GAME = "Загрузить иргу";
    public static final String RETURN_MENU = "Выйти в главное меню";

    public static final String INTRODUCTION = "Каждое утро Лисёнок просыпался, завтракал и шёл увидеться с Бельчонком. " +
            "Это утро не было исключением. Лисёнок пришёл на их \n" +
            "обычное место встречи, но Бельчонка там не было. " +
            "Лисёнок ждал, ждал, но так и не смог дождаться своего друга." +
            " \" Бельчонок не\nпропустил еще ни одной встречи, вдруг он попал в беду.\"" +
            " - подумал Лисёнок. Как поступить Лисенку?\n" +
            "1. Вернуться домой\n" +
            "2. Отправиться на поиски\n" +
            "3. Выйти в главное меню";

    public static final String HAPPY_END = "Вернувшись домой, Лисёнок нашёл там Бельчонка. " +
            "Оказалось, что Бельчонок пришёл на место встречи раньше и увидел там рой\nзлобных пчел. " +
            "Он поспешил предупредить об этом Лисёнка, но они разминулись. Наконец-то друзья нашли друг друга!" +
            "Игра\nзавершилась успехом";


    public static final String TRY_TO_SEARCH = "Все лесные жители были заняты своими делами" +
            " и не обращали внимания на Лисёнка и его проблему. " +
            "Но вдруг кто нибудь видел\nБельчонка... Лисёнок не знал, что ему делать. Помогите ему.\n" +
            "1. Попытаться разузнать о Бельчонке у лесных жителей\n" +
            "2. Искать Бельчонка в одиночку\n" +
            "3. Выйти в главное меню";


    public static final String TRY_TO_ASK_LOCALS = "Пока Лисёнок принимал решение, лесные жители разошлись кто куда. " +
            "Остались только Сова и Волк. " +
            "Но у Совы бывают проблемы с\nпамятью, а Волк может сильно разозлиться из-за расспросов. Кого выбрать?\n" +
            "1. Расспросить Сову\n" +
            "2. Расспросить Волка\n" +
            "3. Выйти в главное меню";


    public static final String UNHAPPY_END_SEARCH =
            "Лисёнок слишком долго плутал по лесу в поисках друга и сам не заметил, как заблудился. " +
                    "Теперь его самого нужно искать. Игра\nзавершилась неудачей";

    public static final String TRY_TO_ASK_THE_OWL =
            "Сова долго не хотела говорить, но в итоге сказала, что видела испуганного Бельчонка," +
                    " бежавшего вглубь леса. " +
                    "Все лесные жители\nзнают, что в глубине леса опасно, если Бельчонок там, ему срочно нужна помощь.\n" +
                    "1. Поверить Сове и отправиться вглубь леса\n" +
                    "2. Сове не стоит верить -> Искать Бельчонка в одиночку\n" +
                    "3. Выйти в главное меню";

    public static final String TRY_TO_ASK_THE_WOLF =
            "Волк оказался вполне дружелюбным, но помочь не смог. " +
                    "Лишь сказал, что маленькому лисенку не стоит бродить по лесу одному. И как\nтеперь поступить?\n" +
                    "1. Волк прав -> Вернуться домой\n" +
                    "2. Искать Бельчонка в одиночку\n" +
                    "3. Выйти в главное меню";

    public static final String TRUST_THE_OWL =
            "В глубине леса Лисёнок встретил Медвежонка. " +
                    "Ленивый Медвежонок был готов рассказать все, что знает, если Лисёнок принесёт ему\nмёда.\n" +
                    "1. Нет, потрачено слишком много времени, нужно идти дальше -> Искать Бельчонка в одиночку\n" +
                    "2. Нужно воспользоваться шансом и раздобыть мёд\n" +
                    "3. Выйти в главное меню";

    public static final String FIND_THE_HONEY =
            "Лисёнок быстро нашёл мёд, но вокруг летал рой злобных пчел. " +
                    "Лисёнок всегда боялся пчёл, но и не найти друга он тоже боялся.\n" +
                    "1. Подождать, вдруг пчёлы улетят\n" +
                    "2. Нужно попытаться выкрасть мёд немедленно\n" +
                    "3. Выйти в главное меню";

    public static final String WAIT_FOR_THE_BEES = "Лисёнок подождал немного, и пчёлы разлетелись. " +
            "Лисёнок без проблем набрал мёда. Вдруг он понял, что очень голоден. Что же\nделать?\n" +
            "1. Поесть немного и передохнуть\n" +
            "2. Скорее отнести мёд Медвежонку\n" +
            "3. Выйти в главное меню";


    public static final String UNHAPPY_END_STEAL =
            "Это была не лучшая идея. Пчёлы покусали Лисёнка, теперь ему самому нужна помощь. " +
                    "Игра завершилась неудачей";

    public static final String UNHAPPY_END_REST =
            "Пока Лисёнок ел, злобные пчёлы вернулись и покусали его. " +
                    "Лисёнку нужна помощь, он не сможет продолжить поиски. Игра\nзавершилась неудачей";

    public static final String BRING_THE_HONEY_TO_THE_BEAR =
            "Довольный Медвежонок рассказал Лисёнку, что очень хорошо знает семью Белок и уверен," +
                    " что Бельчонок никогда не пошёл бы в\nглубь леса. " +
                    "Он заверял Лисёнка, что Белки не попадают в неприятности," +
                    " и что Совам нельзя верить, он также уговаривал Лисёнка\nвернуться домой.\n" +
                    "1. Медвежонок ничего не знает, нужно продолжить поиски -> Искать Бельчонка в одиночку\n" +
                    "2. Может быть он прав и Лисёнок просто паникует -> Вернуться домой\n" +
                    "3. Выйти в главное меню";
}
