package com.soroko.project.textQuest;

public class Paragraph {
    public void comeBackHome() {
        System.out.println("Вернувшись домой, Лисёнок нашёл там Бельчонка. " +
                "Оказалось, что Бельчонок пришёл на место встречи раньше и увидел там рой злобных пчел. " +
                "Он поспешил предупредить об этом Лисёнка, но они разминулись. Наконец-то друзья нашли друг друга! " +
                "Игра завершилась успехом");
    }

    public void tryToSearch() {
        System.out.println("Все лесные жители были заняты своими делами" +
                " и не обращали внимания на Лисёнка и его проблему. " +
                "Но вдруг кто нибудь видел Бельчонка... Лисёнок не знал, что ему делать. Помогите ему.");
    }

    public void tryToAskForestDwellers() {
        System.out.println("Пока Лисёнок принимал решение, лесные жители разошлись кто куда. " +
                "Остались только Сова и Волк. " +
                "Но у Совы бывают проблемы с памятью, а Волк может сильно разозлиться из-за расспросов. Кого выбрать?");
    }

    public void tryToSearchSquirrelAlone() {
        System.out.println("Лисёнок слишком долго плутал по лесу в поисках друга и сам не заметил, как заблудился. " +
                "Теперь его самого нужно искать. Игра завершилась неудачей");
    }

    public void askTheOwl() {
        System.out.println("Сова долго не хотела говорить, но в итоге сказала, что видела испуганного Бельчонка," +
                " бежавшего вглубь леса. " +
                "Все лесные жители знают, что в глубине леса опасно, если Бельчонок там, ему срочно нужна помощь.");
    }

    public void askTheWolf() {
        System.out.println("Волк оказался вполне дружелюбным, но помочь не смог. " +
                "Лишь сказал, что маленькому лисенку не стоит бродить по лесу одному. И как теперь поступить?");
    }

    public void goDeepIntoTheForest () {
        System.out.println("В глубине леса Лисёнок встретил Медвежонка. " +
                "Ленивый Медвежонок был готов рассказать все, что знает, если Лисёнок принесёт ему мёда.");
    }

    public void tryToFindTheHoney() {
        System.out.println("Лисёнок быстро нашёл мёд, но вокруг летал рой злобных пчел. " +
                "Лисёнок всегда боялся пчёл, но и не найти друга он тоже боялся.");
    }

    public void waitForTheBeesToFlyAway() {
        System.out.println("Лисёнок подождал немного, и пчёлы разлетелись. " +
                "Лисёнок без проблем набрал мёда. Вдруг он понял, что очень голоден. Что же делать?");
    }

    public void stealHoneyImmediately() {
        System.out.println("Это была не лучшая идея. Пчёлы покусали Лисёнка, теперь ему самому нужна помощь. " +
                "Игра завершилась неудачей");
    }

    public void eatAndRest() {
        System.out.println("Пока Лисёнок ел, злобные пчёлы вернулись и покусали его. " +
                "Лисёнку нужна помощь, он не сможет продолжить поиски. Игра завершилась неудачей");
    }

    public void carryHoneyToTheBear() {
        System.out.println("Довольный Медвежонок рассказал Лисёнку, что очень хорошо знает семью Белок и уверен," +
                " что Бельчонок никогда не пошёл бы в глубь леса. " +
                "Он заверял Лисёнка, что Белки не попадают в неприятности," +
                " и что Совам нельзя верить, он также уговаривал Лисёнка вернуться домой.");
    }
}
